In [1]:
import pandas as pd

In [3]:
data = pd.Series([0.25,0.5,0.75,1.0],index=['a','b','c','d'])

In [5]:
print(pd.__version__)

1.4.4

In [8]:
type(data.values)

numpy.ndarray

In [10]:
type(data)

pandas.core.series.Series

In [11]:
data.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [13]:
data['a']

0.25

In [14]:
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [17]:
grades_dict = {'A':4,'B':3.5,'C':3,'D':2.5}
grades = pd.Series(grades_dict)

In [18]:
marks_dict = {'A':85,'B':75,'C':65,'D':55}
marks = pd.Series(marks_dict)

In [19]:
marks

A    85
B    75
C    65
D    55
dtype: int64

In [20]:
marks['A']

85

In [21]:
marks[0:2]

A    85
B    75
dtype: int64

In [23]:
rs = pd.DataFrame({'Marks':marks,'Grades':grades})

In [24]:
rs

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [25]:
rs.T

           A     B     C     D
Marks   85.0  75.0  65.0  55.0
Grades   4.0   3.5   3.0   2.5

In [26]:
rs.values

array([[85. ,  4. ],
       [75. ,  3.5],
       [65. ,  3. ],
       [55. ,  2.5]])

In [27]:
rs.values[2,0]

65.0

In [28]:
rs.columns

Index(['Marks', 'Grades'], dtype='object')

In [29]:
rs.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [30]:
rs

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [31]:
rs['scalesMarks'] = 100*rs['Marks']/90
rs

   Marks  Grades  scalesMarks
A     85     4.0    94.444444
B     75     3.5    83.333333
C     65     3.0    72.222222
D     55     2.5    61.111111

In [33]:
del rs['scalesMarks']
rs

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [34]:
G = rs[rs['Marks']>70]

In [36]:
G

   Marks  Grades
A     85     4.0
B     75     3.5

In [ ]:
A_dict = {}